tap "adoptopenjdk/openjdk"
tap "cue-lang/tap"
tap "dart-lang/dart"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"
tap "shopify/shopify"
tap "wix/brew"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# X.509 and CMS library
brew "libksba"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# GNU grep, egrep and fgrep
brew "grep"
# C XSLT library for GNOME
brew "libxslt"
# Platform built on V8 to build network applications
brew "node@14"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Compression and file packaging/archive utility
brew "zip"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# CUE is an open source data constraint language which aims to simplify tasks involving defining and using data.
brew "cue-lang/tap/cue"
# SDK
brew "dart-lang/dart/dart"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Theme Kit is a tool kit for manipulating shopify themes
brew "shopify/shopify/themekit"
# Apple simulator utilities
brew "wix/brew/applesimutils", args: ["HEAD"]
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk15"
# GPU-accelerated terminal emulator
cask "alacritty"
# Allows connection to a computer remotely
cask "anydesk"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser-beta"
# Web browser focusing on privacy
cask "brave-browser-dev"
# Web browser focusing on privacy
cask "brave-browser-nightly"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Client for the Dropbox cloud storage service
cask "dropbox"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# VPN client for secure internet access and private browsing
cask "expressvpn"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Tool to turn any web page into a desktop app
cask "flotato"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-hack-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Free and open-source media player
cask "iina"
# Keyboard customizer
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Utility to toggle dark mode
cask "nightowl"
# App to write, plan, collaborate, and get organized
cask "notion"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# File sharing app
cask "send-anywhere"
# All-in-one live streaming software
cask "streamlabs-obs"
# Messaging app with a focus on speed and security
cask "telegram"
# Customizable email client
cask "thunderbird"
# Git client focusing on power and productivity
cask "tower"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
